package com.china.day08;

/**
 * @author Eric Lee
 * @date 2020/7/22 15:39
 */
public  class Demo1 {
    public static void main(String[] args) {
        /**
         *  继承会继承父类所有的非私有属性和方法
         *  抽象类： Java语言规定， 包含抽象方法的类就是抽象类
         *  抽象方法：我们把没有方法主体的方法称为抽象方法
         *  抽象方法：没有方法体的方法
         *  抽象类：包含抽象方法的类
         *  修饰符  abstract 返回值类型 方法名(参数列表);
         *  如果一个类包含抽象方法，则该类必须是抽象类
         *  注意事项：
         *  1、 抽象类是不能被创建的
         *  2、 抽象类中， 可以有构造方法供子类创建对象是初始化父类成员
         *  3、 抽象类中，不一定包含抽象方法， 但是抽象方法的类必定是抽象类
         *  4、 抽象类的子类必须重写父类的所有抽象方法，除非该子类也是抽象
         */

    }

   // public abstract void run();
}
